export const defaultSort = [
  '基隆市',
  '臺北市',
  '新北市',
  '桃園市',
  '新竹市',
  '新竹縣',
  '苗栗縣',
  '臺中市',
  '彰化縣',
  '南投縣',
  '雲林縣',
  '嘉義市',
  '嘉義縣',
  '臺南市',
  '高雄市',
  '屏東縣',
  '宜蘭縣',
  '花蓮縣',
  '臺東縣',
  '澎湖縣',
  '金門縣',
  '連江縣',
];

export const mainTabs = ['今明', '一周'];
export const todayTomorrow_All = [
  '今日白天',
  '今晚明晨',
  '明日白天',
  '明日晚上',
];
export const weatherEmoji = {
  '☁️': ['陰天', '多雲時陰', '陰時多雲'],
  '🌧️': [
    '陰有雨',
    '陰短暫雨',
    '陰短暫陣雨',
    '多雲短暫雨',
    '多雲短暫陣雨',
    '多雲時陰短暫雨',
    '多雲時陰短暫陣雨',
    '陰時多雲有雨',
    '陰時多雲短暫雨',
    '陰時多雲短暫陣雨',
  ],
  '⛅': ['多雲'],
  '🌥️': ['多雲時晴'],
  '🌤️': ['晴時多雲'],
};

export const week = {
  days: ['日', '一', '二', '三', '四', '五', '六'],
  time: ['白天', '晚上'],
};

export const color = {
  低量級: 'lawngreen',
  中量級: 'gold',
  高量級: 'orange',
  過量級: 'orangered',
  危險級: 'purple',
};
